#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```


[command]/home/runner/work/_temp/d5e3c85b-6d9f-40aa-a5e4-f73acdc913ed/terraform-bin plan -no-color Acquiring state lock. This may take a few moments... Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols: + create Terraform will perform the following actions: # module.submodule_cicd[0].module.network.tencentcloud_subnet.subnet will be created + resource "tencentcloud_subnet" "subnet" { + availability_zone = "ap-guangzhou-3" + available_ip_count = (known after apply) + cidr_block = "10.4.0.0/24" + create_time = (known after apply) + id = (known after apply) + is_default = (known after apply) + is_multicast = true + name = "simple-subnet-dev" + route_table_id = (known after apply) + vpc_id = (known after apply) } # module.submodule_cicd[0].module.network.tencentcloud_vpc.vpc will be created + resource "tencentcloud_vpc" "vpc" { + assistant_cidrs = (known after apply) + cidr_block = "10.4.0.0/16" + create_time = (known after apply) + default_route_table_id = (known after apply) + dns_servers = (known after apply) + id = (known after apply) + is_default = (known after apply) + is_multicast = true + name = "simple-vpc-dev" } Plan: 2 to add, 0 to change, 0 to destroy. ───────────────────────────────────────────────────────────────────────────── Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now. Releasing state lock. This may take a few moments... ::debug::Terraform exited with code 0. ::debug::stdout: Acquiring state lock. This may take a few moments...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A + create%0A%0ATerraform will perform the following actions:%0A%0A # module.submodule_cicd[0].module.network.tencentcloud_subnet.subnet will be created%0A + resource "tencentcloud_subnet" "subnet" {%0A + availability_zone = "ap-guangzhou-3"%0A + available_ip_count = (known after apply)%0A + cidr_block = "10.4.0.0/24"%0A + create_time = (known after apply)%0A + id = (known after apply)%0A + is_default = (known after apply)%0A + is_multicast = true%0A + name = "simple-subnet-dev"%0A + route_table_id = (known after apply)%0A + vpc_id = (known after apply)%0A }%0A%0A # module.submodule_cicd[0].module.network.tencentcloud_vpc.vpc will be created%0A + resource "tencentcloud_vpc" "vpc" {%0A + assistant_cidrs = (known after apply)%0A + cidr_block = "10.4.0.0/16"%0A + create_time = (known after apply)%0A + default_route_table_id = (known after apply)%0A + dns_servers = (known after apply)%0A + id = (known after apply)%0A + is_default = (known after apply)%0A + is_multicast = true%0A + name = "simple-vpc-dev"%0A }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0AReleasing state lock. This may take a few moments...%0A ::debug::stderr: ::debug::exitcode: 0 ::set-output name=stdout::Acquiring state lock. This may take a few moments...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A + create%0A%0ATerraform will perform the following actions:%0A%0A # module.submodule_cicd[0].module.network.tencentcloud_subnet.subnet will be created%0A + resource "tencentcloud_subnet" "subnet" {%0A + availability_zone = "ap-guangzhou-3"%0A + available_ip_count = (known after apply)%0A + cidr_block = "10.4.0.0/24"%0A + create_time = (known after apply)%0A + id = (known after apply)%0A + is_default = (known after apply)%0A + is_multicast = true%0A + name = "simple-subnet-dev"%0A + route_table_id = (known after apply)%0A + vpc_id = (known after apply)%0A }%0A%0A # module.submodule_cicd[0].module.network.tencentcloud_vpc.vpc will be created%0A + resource "tencentcloud_vpc" "vpc" {%0A + assistant_cidrs = (known after apply)%0A + cidr_block = "10.4.0.0/16"%0A + create_time = (known after apply)%0A + default_route_table_id = (known after apply)%0A + dns_servers = (known after apply)%0A + id = (known after apply)%0A + is_default = (known after apply)%0A + is_multicast = true%0A + name = "simple-vpc-dev"%0A }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0AReleasing state lock. This may take a few moments...%0A ::set-output name=stderr:: ::set-output name=exitcode::0
[command]/home/runner/work/_temp/d5e3c85b-6d9f-40aa-a5e4-f73acdc913ed/terraform-bin plan -no-color Acquiring state lock. This may take a few moments... Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols: + create Terraform will perform the following actions: # module.submodule_qta[0].module.network.tencentcloud_subnet.subnet will be created + resource "tencentcloud_subnet" "subnet" { + availability_zone = "ap-guangzhou-3" + available_ip_count = (known after apply) + cidr_block = "10.0.0.0/24" + create_time = (known after apply) + id = (known after apply) + is_default = (known after apply) + is_multicast = true + name = "simple-subnet" + route_table_id = (known after apply) + vpc_id = (known after apply) } # module.submodule_qta[0].module.network.tencentcloud_vpc.vpc will be created + resource "tencentcloud_vpc" "vpc" { + assistant_cidrs = (known after apply) + cidr_block = "10.0.0.0/16" + create_time = (known after apply) + default_route_table_id = (known after apply) + dns_servers = (known after apply) + id = (known after apply) + is_default = (known after apply) + is_multicast = true + name = "simple-vpc" } # module.submodule_qta[0].module.security_group.tencentcloud_security_group.sg will be created + resource "tencentcloud_security_group" "sg" { + id = (known after apply) + name = "simple-security-group" + project_id = (known after apply) } # module.submodule_qta[0].module.security_group.tencentcloud_security_group_lite_rule.sg_rules will be created + resource "tencentcloud_security_group_lite_rule" "sg_rules" { + egress = [ + "ACCEPT#0.0.0.0/0#ALL#ALL", ] + id = (known after apply) + ingress = [ + "ACCEPT#10.0.0.0/16#ALL#ALL", + "ACCEPT#172.16.0.0/22#ALL#ALL", ] + security_group_id = (known after apply) } # module.submodule_qta[0].module.tencentcloud_tke.random_password.worker_pwd will be created + resource "random_password" "worker_pwd" { + bcrypt_hash = (sensitive value) + id = (known after apply) + length = 12 + lower = true + min_lower = 0 + min_numeric = 1 + min_special = 1 + min_upper = 1 + number = true + numeric = true + override_special = "!#$%&*()-_=+[]{}<>:?" + result = (sensitive value) + special = true + upper = true } # module.submodule_qta[0].module.tencentcloud_tke.tencentcloud_kubernetes_cluster.cluster will be created + resource "tencentcloud_kubernetes_cluster" "cluster" { + certification_authority = (known after apply) + claim_expired_seconds = 300 + cluster_as_enabled = false + cluster_cidr = "172.16.0.0/22" + cluster_deploy_type = "MANAGED_CLUSTER" + cluster_external_endpoint = (known after apply) + cluster_internet = true + cluster_internet_security_group = (known after apply) + cluster_intranet = true + cluster_intranet_subnet_id = (known after apply) + cluster_ipvs = true + cluster_level = (known after apply) + cluster_max_pod_num = 256 + cluster_max_service_num = 256 + cluster_name = "example-cluster" + cluster_node_num = (known after apply) + cluster_os = "tlinux2.2(tkernel3)x86_64" + cluster_os_type = "GENERAL" + cluster_version = "1.22.5" + container_runtime = "docker" + deletion_protection = false + domain = (known after apply) + enable_customized_pod_cidr = false + id = (known after apply) + ignore_cluster_cidr_conflict = false + is_non_static_ip_mode = false + kube_config = (known after apply) + kube_config_intranet = (known after apply) + network_type = "GR" + node_name_type = "lan-ip" + password = (known after apply) + pgw_endpoint = (known after apply) + security_policy = (known after apply) + upgrade_instances_follow_cluster = false + user_name = (known after apply) + vpc_id = (known after apply) + worker_instances_list = (known after apply) + node_pool_global_config { + expander = (known after apply) + ignore_daemon_sets_utilization = (known after apply) + is_scale_in_enabled = (known after apply) + max_concurrent_scale_in = (known after apply) + scale_in_delay = (known after apply) + scale_in_unneeded_time = (known after apply) + scale_in_utilization_threshold = (known after apply) + skip_nodes_with_local_storage = (known after apply) + skip_nodes_with_system_pods = (known after apply) } + worker_config { + availability_zone = "ap-guangzhou-3" + count = 1 + desired_pod_num = 0 + enhanced_monitor_service = true + enhanced_security_service = true + instance_charge_type = "POSTPAID_BY_HOUR" + instance_charge_type_prepaid_period = 1 + instance_charge_type_prepaid_renew_flag = "NOTIFY_AND_MANUAL_RENEW" + instance_name = "sub machine of tke" + instance_type = "S5.MEDIUM2" + internet_charge_type = "TRAFFIC_POSTPAID_BY_HOUR" + internet_max_bandwidth_out = 0 + password = (sensitive value) + security_group_ids = (known after apply) + subnet_id = (known after apply) + system_disk_size = 50 + system_disk_type = "CLOUD_PREMIUM" } } Plan: 6 to add, 0 to change, 0 to destroy. ───────────────────────────────────────────────────────────────────────────── Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now. Releasing state lock. This may take a few moments... ::debug::Terraform exited with code 0. ::debug::stdout: Acquiring state lock. This may take a few moments...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A + create%0A%0ATerraform will perform the following actions:%0A%0A # module.submodule_qta[0].module.network.tencentcloud_subnet.subnet will be created%0A + resource "tencentcloud_subnet" "subnet" {%0A + availability_zone = "ap-guangzhou-3"%0A + available_ip_count = (known after apply)%0A + cidr_block = "10.0.0.0/24"%0A + create_time = (known after apply)%0A + id = (known after apply)%0A + is_default = (known after apply)%0A + is_multicast = true%0A + name = "simple-subnet"%0A + route_table_id = (known after apply)%0A + vpc_id = (known after apply)%0A }%0A%0A # module.submodule_qta[0].module.network.tencentcloud_vpc.vpc will be created%0A + resource "tencentcloud_vpc" "vpc" {%0A + assistant_cidrs = (known after apply)%0A + cidr_block = "10.0.0.0/16"%0A + create_time = (known after apply)%0A + default_route_table_id = (known after apply)%0A + dns_servers = (known after apply)%0A + id = (known after apply)%0A + is_default = (known after apply)%0A + is_multicast = true%0A + name = "simple-vpc"%0A }%0A%0A # module.submodule_qta[0].module.security_group.tencentcloud_security_group.sg will be created%0A + resource "tencentcloud_security_group" "sg" {%0A + id = (known after apply)%0A + name = "simple-security-group"%0A + project_id = (known after apply)%0A }%0A%0A # module.submodule_qta[0].module.security_group.tencentcloud_security_group_lite_rule.sg_rules will be created%0A + resource "tencentcloud_security_group_lite_rule" "sg_rules" {%0A + egress = [%0A + "ACCEPT#0.0.0.0/0#ALL#ALL",%0A ]%0A + id = (known after apply)%0A + ingress = [%0A + "ACCEPT#10.0.0.0/16#ALL#ALL",%0A + "ACCEPT#172.16.0.0/22#ALL#ALL",%0A ]%0A + security_group_id = (known after apply)%0A }%0A%0A # module.submodule_qta[0].module.tencentcloud_tke.random_password.worker_pwd will be created%0A + resource "random_password" "worker_pwd" {%0A + bcrypt_hash = (sensitive value)%0A + id = (known after apply)%0A + length = 12%0A + lower = true%0A + min_lower = 0%0A + min_numeric = 1%0A + min_special = 1%0A + min_upper = 1%0A + number = true%0A + numeric = true%0A + override_special = "!#$%25&*()-_=+[]{}<>:?"%0A + result = (sensitive value)%0A + special = true%0A + upper = true%0A }%0A%0A # module.submodule_qta[0].module.tencentcloud_tke.tencentcloud_kubernetes_cluster.cluster will be created%0A + resource "tencentcloud_kubernetes_cluster" "cluster" {%0A + certification_authority = (known after apply)%0A + claim_expired_seconds = 300%0A + cluster_as_enabled = false%0A + cluster_cidr = "172.16.0.0/22"%0A + cluster_deploy_type = "MANAGED_CLUSTER"%0A + cluster_external_endpoint = (known after apply)%0A + cluster_internet = true%0A + cluster_internet_security_group = (known after apply)%0A + cluster_intranet = true%0A + cluster_intranet_subnet_id = (known after apply)%0A + cluster_ipvs = true%0A + cluster_level = (known after apply)%0A + cluster_max_pod_num = 256%0A + cluster_max_service_num = 256%0A + cluster_name = "example-cluster"%0A + cluster_node_num = (known after apply)%0A + cluster_os = "tlinux2.2(tkernel3)x86_64"%0A + cluster_os_type = "GENERAL"%0A + cluster_version = "1.22.5"%0A + container_runtime = "docker"%0A + deletion_protection = false%0A + domain = (known after apply)%0A + enable_customized_pod_cidr = false%0A + id = (known after apply)%0A + ignore_cluster_cidr_conflict = false%0A + is_non_static_ip_mode = false%0A + kube_config = (known after apply)%0A + kube_config_intranet = (known after apply)%0A + network_type = "GR"%0A + node_name_type = "lan-ip"%0A + password = (known after apply)%0A + pgw_endpoint = (known after apply)%0A + security_policy = (known after apply)%0A + upgrade_instances_follow_cluster = false%0A + user_name = (known after apply)%0A + vpc_id = (known after apply)%0A + worker_instances_list = (known after apply)%0A%0A + node_pool_global_config {%0A + expander = (known after apply)%0A + ignore_daemon_sets_utilization = (known after apply)%0A + is_scale_in_enabled = (known after apply)%0A + max_concurrent_scale_in = (known after apply)%0A + scale_in_delay = (known after apply)%0A + scale_in_unneeded_time = (known after apply)%0A + scale_in_utilization_threshold = (known after apply)%0A + skip_nodes_with_local_storage = (known after apply)%0A + skip_nodes_with_system_pods = (known after apply)%0A }%0A%0A + worker_config {%0A + availability_zone = "ap-guangzhou-3"%0A + count = 1%0A + desired_pod_num = 0%0A + enhanced_monitor_service = true%0A + enhanced_security_service = true%0A + instance_charge_type = "POSTPAID_BY_HOUR"%0A + instance_charge_type_prepaid_period = 1%0A + instance_charge_type_prepaid_renew_flag = "NOTIFY_AND_MANUAL_RENEW"%0A + instance_name = "sub machine of tke"%0A + instance_type = "S5.MEDIUM2"%0A + internet_charge_type = "TRAFFIC_POSTPAID_BY_HOUR"%0A + internet_max_bandwidth_out = 0%0A + password = (sensitive value)%0A + security_group_ids = (known after apply)%0A + subnet_id = (known after apply)%0A + system_disk_size = 50%0A + system_disk_type = "CLOUD_PREMIUM"%0A }%0A }%0A%0APlan: 6 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0AReleasing state lock. This may take a few moments...%0A ::debug::stderr: ::debug::exitcode: 0 ::set-output name=stdout::Acquiring state lock. This may take a few moments...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A + create%0A%0ATerraform will perform the following actions:%0A%0A # module.submodule_qta[0].module.network.tencentcloud_subnet.subnet will be created%0A + resource "tencentcloud_subnet" "subnet" {%0A + availability_zone = "ap-guangzhou-3"%0A + available_ip_count = (known after apply)%0A + cidr_block = "10.0.0.0/24"%0A + create_time = (known after apply)%0A + id = (known after apply)%0A + is_default = (known after apply)%0A + is_multicast = true%0A + name = "simple-subnet"%0A + route_table_id = (known after apply)%0A + vpc_id = (known after apply)%0A }%0A%0A # module.submodule_qta[0].module.network.tencentcloud_vpc.vpc will be created%0A + resource "tencentcloud_vpc" "vpc" {%0A + assistant_cidrs = (known after apply)%0A + cidr_block = "10.0.0.0/16"%0A + create_time = (known after apply)%0A + default_route_table_id = (known after apply)%0A + dns_servers = (known after apply)%0A + id = (known after apply)%0A + is_default = (known after apply)%0A + is_multicast = true%0A + name = "simple-vpc"%0A }%0A%0A # module.submodule_qta[0].module.security_group.tencentcloud_security_group.sg will be created%0A + resource "tencentcloud_security_group" "sg" {%0A + id = (known after apply)%0A + name = "simple-security-group"%0A + project_id = (known after apply)%0A }%0A%0A # module.submodule_qta[0].module.security_group.tencentcloud_security_group_lite_rule.sg_rules will be created%0A + resource "tencentcloud_security_group_lite_rule" "sg_rules" {%0A + egress = [%0A + "ACCEPT#0.0.0.0/0#ALL#ALL",%0A ]%0A + id = (known after apply)%0A + ingress = [%0A + "ACCEPT#10.0.0.0/16#ALL#ALL",%0A + "ACCEPT#172.16.0.0/22#ALL#ALL",%0A ]%0A + security_group_id = (known after apply)%0A }%0A%0A # module.submodule_qta[0].module.tencentcloud_tke.random_password.worker_pwd will be created%0A + resource "random_password" "worker_pwd" {%0A + bcrypt_hash = (sensitive value)%0A + id = (known after apply)%0A + length = 12%0A + lower = true%0A + min_lower = 0%0A + min_numeric = 1%0A + min_special = 1%0A + min_upper = 1%0A + number = true%0A + numeric = true%0A + override_special = "!#$%25&*()-_=+[]{}<>:?"%0A + result = (sensitive value)%0A + special = true%0A + upper = true%0A }%0A%0A # module.submodule_qta[0].module.tencentcloud_tke.tencentcloud_kubernetes_cluster.cluster will be created%0A + resource "tencentcloud_kubernetes_cluster" "cluster" {%0A + certification_authority = (known after apply)%0A + claim_expired_seconds = 300%0A + cluster_as_enabled = false%0A + cluster_cidr = "172.16.0.0/22"%0A + cluster_deploy_type = "MANAGED_CLUSTER"%0A + cluster_external_endpoint = (known after apply)%0A + cluster_internet = true%0A + cluster_internet_security_group = (known after apply)%0A + cluster_intranet = true%0A + cluster_intranet_subnet_id = (known after apply)%0A + cluster_ipvs = true%0A + cluster_level = (known after apply)%0A + cluster_max_pod_num = 256%0A + cluster_max_service_num = 256%0A + cluster_name = "example-cluster"%0A + cluster_node_num = (known after apply)%0A + cluster_os = "tlinux2.2(tkernel3)x86_64"%0A + cluster_os_type = "GENERAL"%0A + cluster_version = "1.22.5"%0A + container_runtime = "docker"%0A + deletion_protection = false%0A + domain = (known after apply)%0A + enable_customized_pod_cidr = false%0A + id = (known after apply)%0A + ignore_cluster_cidr_conflict = false%0A + is_non_static_ip_mode = false%0A + kube_config = (known after apply)%0A + kube_config_intranet = (known after apply)%0A + network_type = "GR"%0A + node_name_type = "lan-ip"%0A + password = (known after apply)%0A + pgw_endpoint = (known after apply)%0A + security_policy = (known after apply)%0A + upgrade_instances_follow_cluster = false%0A + user_name = (known after apply)%0A + vpc_id = (known after apply)%0A + worker_instances_list = (known after apply)%0A%0A + node_pool_global_config {%0A + expander = (known after apply)%0A + ignore_daemon_sets_utilization = (known after apply)%0A + is_scale_in_enabled = (known after apply)%0A + max_concurrent_scale_in = (known after apply)%0A + scale_in_delay = (known after apply)%0A + scale_in_unneeded_time = (known after apply)%0A + scale_in_utilization_threshold = (known after apply)%0A + skip_nodes_with_local_storage = (known after apply)%0A + skip_nodes_with_system_pods = (known after apply)%0A }%0A%0A + worker_config {%0A + availability_zone = "ap-guangzhou-3"%0A + count = 1%0A + desired_pod_num = 0%0A + enhanced_monitor_service = true%0A + enhanced_security_service = true%0A + instance_charge_type = "POSTPAID_BY_HOUR"%0A + instance_charge_type_prepaid_period = 1%0A + instance_charge_type_prepaid_renew_flag = "NOTIFY_AND_MANUAL_RENEW"%0A + instance_name = "sub machine of tke"%0A + instance_type = "S5.MEDIUM2"%0A + internet_charge_type = "TRAFFIC_POSTPAID_BY_HOUR"%0A + internet_max_bandwidth_out = 0%0A + password = (sensitive value)%0A + security_group_ids = (known after apply)%0A + subnet_id = (known after apply)%0A + system_disk_size = 50%0A + system_disk_type = "CLOUD_PREMIUM"%0A }%0A }%0A%0APlan: 6 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0AReleasing state lock. This may take a few moments...%0A ::set-output name=stderr:: ::set-output name=exitcode::0
```

</details>

*Pushed by: @tongyiming, Action: `pull_request`*